In [1]:
import sqlalchemy as db
from getpass import getpass
import pymysql

In [2]:
password = getpass("Mysql Password: ")

Mysql Password: ········

In [3]:
dbName = "Publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [4]:

engine = db.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [5]:
import pandas as pd

In [8]:
df = pd.read_sql_query('''
SELECT 
		a.au_id 'AUTHOR ID', 
		t.title_id 'TITLE ID',
		t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100 'sales_royalty'
			FROM authors a  
			LEFT JOIN titleauthor ta ON a.au_id = ta.au_id
			LEFT JOIN titles t ON ta.title_id = t.title_id
			LEFT JOIN sales s ON s.title_id = t.title_id''', engine)
df.head()

     AUTHOR ID TITLE ID  sales_royalty
0  172-32-1176   PS3333         29.985
1  213-46-8915   BU1032          3.998
2  213-46-8915   BU1032          7.996
3  213-46-8915   BU2075         25.116
4  238-95-7766   PC1035        110.160

In [ ]:
#STep 2 no me sale
SELECT 
	a.au_id 'AUTHOR',
	t.title_id 'TITLE_ID',
    sum(sales_royalty)
FROM(SELECT 
		a.au_id 'AUTHOR ID', 
		t.title_id 'TITLE ID',
		t.price * s.qty * t.royalty / 100 * ta.royaltyper / 100 'sales_royalty'
			FROM authors a  
			LEFT JOIN titleauthor ta ON a.au_id = ta.au_id
			LEFT JOIN titles t ON ta.title_id = t.title_id
			LEFT JOIN sales s ON s.title_id = t.title_id
            GROUP BY ta.au_id, t.title_id) AS TABLE1
            ORDER BY sales_royalty